// Ստեղծեք փոփոխական և վերագրեք նրան հետևյալ արժեքը՝ 
// "Գրիգոր՝ 1254-5687-4559-0015, Մարիամ՝ 1120-4475-5559-1566, Արմեն՝ 7855-2114-3354-5641" 
 
// Տեքստում առկա են քարտապաների անունները 
// և իրենց MasterCard-ի 16 նիշանոց թվերը: 
 
// Ձեր առաջադրանքը կայանում է նրանում, 
// որպեսզի կանոնավոր արտահայտությունների միջոցով 
// տեքստում գտնեք միայն քարտերի թվերը և պատկերեք էկրանին ցիկլի միջոցով: 
 
// Այնուհետև կանոնավոր արտահայտությունների միջոցով նշեք, 
// որպեսզի պատկերվեն միայն այն քարտի թվերը, 
// որոնց առաջին 4 թվերում առկա են միայն 0 , 1 ,2 թվերը:

let str = "Գրիգոր՝ 1254-5687-4559-0015, Մարիամ՝ 1120-4475-5559-1566, Արմեն՝ 7855-2114-3354-5641" ;
let reg = /[\d]{4}-\d{4}-\d{4}-\d{4}/g;
let res =str.match(reg);
for (const elem of res) {
    document.write(elem + '<br>')
}
let reg1 = /[0-2]{4}-\d{4}-\d{4}-\d{4}/g;
let res1 = str.match(reg1);
for (const elem of res1) {
    document.write(elem + '<br>')
}