import logo from "./logo.svg";
import './App.css';

function App() {
    // return < >
    {/*7/1. В вашем основном компоненте есть следующая функция:
    Поменяйте текст внутри дива. Посмотрите на изменения, произошедшие в браузере. */}
    {/* 7/2 Добавьте в див несколько абзацев.*/ }
    {/* 7/3. Добавьте вашим абзацам классы. */ }
    {/* <div className='div'>
            hello world
            <p className='text'>David</p>
            <p className='text'>Matevosyan</p>
            <h1 className='text'>Kareni</h1>
        </div> */}
    {/* 8/1У вас есть следующая функция:
        Добавьте внуть тегов ul список из 10 li. */}

    {/* <ul>
            <li>0</li>
            <li>1</li>
            <li>2</li>
            <li>3</li>
            <li>4</li>
            <li>5</li>
            <li>6</li>
            <li>7</li>
            <li>8</li>
            <li>9</li>
        </ul> */}
    {/* 13/1Дан следующий код:
Вставьте первую константу в первый абзац, а вторую константу - во второй. */}

    {/* 14/1 Дан следующий код:
        // Вставьте константу с именем вместо первого знака ?, а константу с возрастом - вместо второго.

        // const name = 'user';
        // const age = '30'; */}
    {/* 
    // return <>
    //     <div>
    //         name: {name}
    //         <br />
    //         age:  {age}
    //     </div> */}

    {/* 15/1 Дан массив:
Сделайте так, чтобы результатом рендеринга был тег ul, в тегах li которого будут стоять элементы массива. */}

    // const arr = [1, 2, 3, 4, 5];

    // return < >
    //     <ul>
    //         <li>
    //             {arr[0]}
    //             <br />
    //         </li>
    //         <li>
    //             {arr[1]}
    //             <br />
    //         </li>
    //         <li>
    //             {arr[2]}
    //             <br />
    //         </li>
    //         <li>
    //             {arr[3]}
    //             <br />
    //         </li>
    //         <li>
    //             {arr[4]}
    //         </li>
    //     </ul>
    // </ >
    // 16.1 Дан объект:
    // Для значений имени и фамилии используйте значения элементов объекта.
    // Сделайте так, чтобы результатом рендеринга был следующий код:


    // const obj = { name: 'john', surname: 'smit' };
    // return <>

    //     <p>
    //         name: <span>{obj.name}</span><br />
    //         surname: <span>{obj.surname}</span>
    //     </p>
    // </>
    // 17.1 Дан следующий код:
    // Вставьте значение константы attr в атрибут id нашего дива.

    //    22/1Добавьте в див несколько инпутов, разделенных тегами br.
    // const inp = <><input /> <br /><br /> <input /><br /><br /><input /></>
    // return <>
    //     {inp}
    // </>
    let a = 3 * 2 ** (3 + 1);
    alert(a);

};

export default App;
